In [18]:
import pandas as pd

In [23]:
import numpy as np

In [2]:
s1 = pd.Series([5,20,50,60,70])

In [3]:
s1

0     5
1    20
2    50
3    60
4    70
dtype: int64

In [4]:
s1[2]

50

In [6]:
s2 =  pd.Series([50,60,70,80],index=['a','b','c','d'])

In [7]:
s2

a    50
b    60
c    70
d    80
dtype: int64

In [8]:
s2['c']

70

In [24]:
df1 = pd.DataFrame(np.random.randint(10,50,[5,4]))
df1

    0   1   2   3
0  38  26  41  41
1  14  39  49  32
2  10  38  43  19
3  35  18  32  38
4  15  10  40  46

In [30]:
df2 = pd.DataFrame(np.random.randint(10,50,[5,4]),
                   index = 'a b c d e'.split(),
                   columns = list("WXYZ"))
df2

    W   X   Y   Z
a  26  16  45  17
b  38  34  38  26
c  37  29  47  17
d  10  46  26  23
e  25  10  30  35

In [33]:
df2['W']

a    26
b    38
c    37
d    10
e    25
Name: W, dtype: int32

In [35]:
df2.loc['b']

W    38
X    34
Y    38
Z    26
Name: b, dtype: int32

In [36]:
df2.W

a    26
b    38
c    37
d    10
e    25
Name: W, dtype: int32

In [37]:
df2.iloc[1]

W    38
X    34
Y    38
Z    26
Name: b, dtype: int32

In [38]:
df2[['W','Z']]

    W   Z
a  26  17
b  38  26
c  37  17
d  10  23
e  25  35

In [39]:
df2.loc[['a','b']]

    W   X   Y   Z
a  26  16  45  17
b  38  34  38  26

In [40]:
df2

    W   X   Y   Z
a  26  16  45  17
b  38  34  38  26
c  37  29  47  17
d  10  46  26  23
e  25  10  30  35

In [41]:
df2.loc['b':'d',['Y','Z']]

    Y   Z
b  38  26
c  47  17
d  26  23

In [42]:
df1

    0   1   2   3
0  38  26  41  41
1  14  39  49  32
2  10  38  43  19
3  35  18  32  38
4  15  10  40  46

In [43]:
df1>20

       0      1     2      3
0   True   True  True   True
1  False   True  True   True
2  False   True  True  False
3   True  False  True   True
4  False  False  True   True

In [44]:
df1[ df1>20 ]

      0     1   2     3
0  38.0  26.0  41  41.0
1   NaN  39.0  49  32.0
2   NaN  38.0  43   NaN
3  35.0   NaN  32  38.0
4   NaN   NaN  40  46.0